# terminal
tap "homebrew/bundle"
cask "ghostty"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
brew "fzf"
brew "gh"
brew "git"
brew "starship"
brew "tree"

# rust
brew "cargo-binstall"
brew "cargo-nextest"
brew "just"
brew "libffi"
brew "rustup"

# swift
brew "fastlane"
brew "ruby-install"
brew "swiftformat"
brew "swiftlint"
brew "xcodegen"
brew "xcode-build-server"

# web
brew "node"
brew "pnpm"

# macOS
cask "slack"
brew "fonttools"

# vscode
cask "visual-studio-code"
vscode "a11ywatch.vscode-a11ywatch-extension"
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "rust-lang.rust-analyzer"
vscode "sswg.swift-lang"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
