tap "homebrew/bundle"
tap "sambadevi/powerlevel9k"
brew "act"
brew "xz"
brew "automake"
brew "libyaml"
brew "azure-cli"
brew "bison"
brew "cargo-binstall"
brew "chruby"
brew "fastlane"
brew "fonttools"
brew "gdbm"
brew "gh"
brew "git"
brew "go"
brew "gtk+3"
brew "hugo"
brew "just"
brew "libffi"
brew "node"
brew "pkgconf"
brew "protobuf"
brew "python@3.10"
brew "ruby-install"
brew "swiftformat"
brew "swiftlint"
brew "terraform"
brew "tree"
brew "xcodegen"
brew "zsh-autosuggestions"
brew "sambadevi/powerlevel9k/powerlevel9k"
cask "visual-studio-code"
vscode "a11ywatch.vscode-a11ywatch-extension"
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "orta.vscode-jest"
vscode "rust-lang.rust-analyzer"
vscode "sswg.swift-lang"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
